{
  "name": "Lifeweaver",
  "description": "The brilliant creator of biolight, a technology that merges plant matter and hard light. He dreams of healing the world.",
  "role": "support",
  "location": "Atlantic Arcology",
  "birthday": "Apr 28",
  "age": 31,
  "hitpoints": {
    "armor": 0,
    "shields": 50,
    "health": 225,
    "total": 275
  },
  "abilities": [
    {
      "name": "Healing Blossom",
      "description": "Hold to charge a healing burst. Release to heal a targeted ally."
    },
    {
      "name": "Thorn Volley",
      "description": "Rapidly fire a spread of projectiles."
    },
    {
      "name": "Petal Platform",
      "description": "Throw a platform that springs upwards when stepped on."
    },
    {
      "name": "Rejuvenating Dash",
      "description": "Dash towards your traveling direction and lightly heal yourself."
    },
    {
      "name": "Life Grip",
      "description": "Pull an ally to your location, protecting them as they travel."
    },
    {
      "name": "Tree of Life",
      "description": "Place a tree that instantly heals allies upon sprouting and continues healing periodically as it lives."
    }
  ],
  "story": {
    "summary": "An artist, activist, and inventor, Lifeweaver has created a new form of life that heals wounds, cures illnesses, and may one day save everyone on the planet... providing the Vishkar Corporation doesn’t catch up with him first.",
    "chapters": [
      {
        "title": "Childhood",
        "content": "Born in Chiang Mai, Thailand, Niran PruksaManee was the middle child of extremely wealthy parents with high expectations for their children. From a young age, he resisted the structured life they had planned for him. He preferred wandering his compound’s vast walled garden, mending plants alongside his family’s gardeners. Even early on, he was too intelligent for the expensive schools his family could afford. He often completed assignments incorrectly (his teachers often complained) by solving problems more thoroughly than was necessary, or in new ways that hinted at his brilliant future. His parents, desperate to instill order in Niran, sent him to the prestigious Vishkar Architech Academy."
      },
      {
        "title": "Roommates",
        "content": "Niran developed an almost immediate distaste for both the rigid, artificial beauty that Vishkar called “perfection”. All of the other students shunned him, save one: his roommate, Satya Vaswani, later known as Symmetra. Within a few weeks, they were inseparable friends, and while they rarely agreed – on anything - they grew to respect each other a great deal."
      },
      {
        "title": "Nature and evolution",
        "content": "As he grew older, during breaks at school, he used his parents’ wealth to travel and learn about his true passion - the natural world. In those journeys, he was struck by the turmoil that existed outside of his perfect bubble of wealth. All around the world, people needed help. Illness, injury, and many other ailments riddled communities with pain—a pain Niran grew determined to fix.  Using the academy’s resources and his parents’ influence, Niran set about on his own project—one that would help him heal the world."
      },
      {
        "title": "Hard light",
        "content": "In his research, he discovered that the late founder of Vishkar had hoped to provide his hard light freely to the world before Vishkar implemented more restrictions to the technology. Using this original design and his fascination with botany, he created something new. While hard light made inanimate material, Niran\u0027s new and unstable invention, biolight, created organic material that could heal terrible wounds in the blink of an eye.  Unfortunately, that was where Niran\u0027s problems began."
      },
      {
        "title": "Hard consequences",
        "content": "Like his visionary predecessor, Niran dreamed of gifting biolight to the world. Vishkar disagreed, claiming ownership of the invention. Ignoring their demands (and Satya Vaswani’s advice), he fled the academy with his nascent technology. His parents cut him off from their wealth and pleaded for him to return, turn over his technology, and make peace with Vishkar.   Alone and hunted, Niran has turned to the Atlantic Arcology, a freestanding and self-sustaining scientific and ecological city in the Atlantic Ocean, free from the governing laws of any nation on the planet. There, Lifeweaver has continued stabilizing and perfecting biolight, and intends to use it to renew the world’s connection with nature and help those in need."
      }
    ]
  }
}